{
  "table_name": "South Park",
  "author_name": "Knorr",
  "table_blurb": null,
  "table_rules": " South Park \r\n\r\n---\r\n\r\nVersion 1 May 18 1999 \r\nCompiled by Robert Macauley\r\nIntroduction\r\n\r\nFirst let me get one thing perfectly clear. I don't like the cartoon series that this game is based on at all. However the same thing applies for a few other licensed games. South Park, and all characters from the series mentioned within this sheet are copyrighted by Comedy Central and used under license by SEGA. That should keep the lawyers off my back. And now, on with the show.\r\n\r\nThe Story So Far\r\n\r\nI've been putting off playing this game for quite a while. The location it was in left a lot to be desired. However, a local bowling alley now have a South Park with the volume turned up a looooong way. This sheet is based on 4 hours play over 2 days. The rom version is A1.00. The sound rom is unknown, but I think that it is the original uncensored version. Your mileage may vary.\r\n\r\nPlayfield Layout\r\n\r\nStarting at the drain and going clockwise around:\r\n\r\nDrain: Same old bad news. No post on our machine.\r\n\r\nInlanes: Light both to start Super Fart Bumpers.\r\n\r\nOutlanes: Can be lit for special.\r\n\r\nBumpers: 3 in the standard formation. Same place as TZ. Balls exiting to the left are fed straight down into the left inlane.\r\n\r\nLeft Lane: A shot through the bumpers. Spots shots towards Stan.\r\n\r\nTargets: 1 target on each side for the left lane entrance. The right one awards 100k+100k per hit as _ assed monkey. The space being the number of times it has been hit.\r\n\r\nGate: A gate above the right bumper leading into the bumper area.\r\n\r\nTargets: 5 townsfolk targets. Used for the skill shot.\r\n\r\nMr Hankey: 3 targets in front of a toilet. Used to count down towards multiball and as a jackpot shot.\r\n\r\nChef Lane: Lane leading to a VUK just like the barbecue shot on Elvira. Spots shots towards Chef and can be lit for Extra Ball, Mystery and Spooky Vision. Balls from the left lane also end up here. Feeds to the area above the bumpers.\r\n\r\nKenny: A large rubber Kenny in front of a hole. Hit either to spot hits on Kenny.\r\n\r\nRamp: Used to spot shots on Kyle, start multiball and super jackpot. The ramp runs over the top of the toilet, which opens when appropriate. The ramp has an R shaped section above the bumper area and 3 possible exits. Balls can exit either through a hole into the bumpers, out a short drop towards the flippers or into the left inlane. There?s a lot of posts here.\r\n\r\nTargets: 3 more townsfolk targets. These add 1M to the anal probe value during Cartman.\r\n\r\nCartman Hole: The return of the sinkhole from hell. Same size and position as the one on Star Wars Trilogy. Not as hard to hit due to a metal piece behind the hole. Used to spot hits on Cartman.\r\n\r\nObjective\r\n\r\nThe main aim of South Park is to start and COMPLETE all 5 character's modes. To start a mode you need to hit each character's shot a number of times. The number of shots required to start a mode increases with each successful completion. The modes for each character are as follows.\r\n\r\nStan: Shoot the left lane 4 times to start. Stan's mode is a 4 ball multiball based around the bumpers and the lane. Your objective is to kiss Stan's girlfriend 3 times. A kiss can be spotted either by a number of bumper hits or a shot to the lane. Shots to the lane are worth a bonus starting at 5M and increasing by 100k per bumper hit. After 3 kisses the display shows \"You Win\". You can still keep shooting the lane for points until 1 ball remains. The graphics for getting a kiss are gross.\r\n\r\nChef: Shoot the center lane 4 times to start Chef's mode. You have 30 seconds to shoot all 5 character's shots. The shots are worth 5M+1M per shot. The last shot is worth 10M. Each shot adds 5 seconds to the timer. Each shot adds a team member to a football team on the display. The COWS!\r\n\r\nKenny: Hit Kenny 4 times to start a hurry-up. Then hit Kenny again to collect the value and kill Kenny. The value starts at 10M. Killing Kenny produces one of several graphic deaths and the inevitable quote \"Oh my god, they've killed Kenny! You Bastards!\"\r\n\r\nKyle: Shoot the ramp 4 times to start Kyle's mode. The aim here is to shoot the ramp 4 times in 20? seconds to revive Mr Hankey. The shots are worth 5M, 10M, 15M and finally 20M.\r\n\r\nCartman: Shoot the hole 4 times to start Cartman's mode. You have 20 seconds to shoot the hole 3 times. Each shot awards 5M + 1M per hit on the 3 targets above the hole. Finishing awards the Anal Probe bonus.\r\n\r\nWhen you start a mode, the character's face on the playfield starts flashing. If the mode is completed the face lights solidly, otherwise it keeps flashing. Modes can be replayed regardless of they have been completed or not.\r\n\r\nWizard Modes\r\n\r\nSouth Park contains 2 wizard modes like Monster Bash. If you start all modes but fail to complete 1 or more, the Chef lane lights for Spooky Vision at the completion of the 5th mode. If you can complete all 5 modes, the red arrow in the Chef lane and the Volcano between the flippers light and shooting the Chef lane starts the real wizard mode called Volcano.\r\n\r\nSpooky Vision: Spooky Vision is a 5 ball multiball where the object is to raise the characters jackpot values by hitting their respective shots a set number of times. More info is required here.\r\n\r\nVolcano: Volcano is another 5 ball multiball where the object is to save South Park from an erupting volcano. You have to shoot 15 lit character shots for 10M apiece. If you are successful the flippers go dead, an extra ball is awarded and you begin the process again. Otherwise the mode ends when 1 ball is left in play. The total for a successful Volcano mode is 210M so there must be a 60M completion bonus.\r\n\r\nSpooky vision does not occur if all 5 modes are completed on the first attempt.\r\n\r\nMultiball\r\n\r\nThis is a bit confusing (to me at least). To light multiball you need to hit the Mr Hankey targets 5 times. Multiball will light at the ramp and until you shoot the ramp any hit to the Hankey targets adds 100k to the base jackpot value. Shoot the ramp to start. The toilet opens and the ball is fed to the right inlane. Multiball is yet another 5 ball affair. The Hankey targets are worth a base jackpot of 1M and each jackpot lights a character for a double jackpot. 5 Hankey jackpots lights the ramp for a super jackpot starting at 5M. I think collecting a super jackpot doubles the value of the next round of jackpots, however I could be wrong. The second super jackpot is worth 10M and each one after that is worth an extra 5M with no known limit. Multiball ends when 1 ball remains.\r\n\r\nMystery\r\n\r\nThe 3 targets above Cartman light the Chef lane for mystery. The awards known at this time are:\r\n\r\n+1 bonus X (very common)\r\n7M\r\nMr Mackey: A frenzy mode with all switches worth 500k for 30 seconds.\r\nThe charity extra ball is also available if your score is below 10M on ball 3.\r\nBonus\r\n\r\nThe bonus value is made up of the following: 100k per shot to any character, the ramp or the townsfolk targets X the bonus X.\r\n\r\nThere is also an outlane drain bonus awarded sometimes worth 1M.\r\n\r\nSkill Shot\r\n\r\nHit the lit target below Mr Hankey for 5M+5M per successful skill shot.\r\n\r\nRandom Notes\r\n\r\nRule number 1, get all the character shots down. The Stan shot is a king size pain but it's well worth the effort. I absolutely hate shots through bumpers but in this case I'll make an exception.\r\n\r\nRule number 2, multiball, multiball, multiball. Any or all of them will do. The 3 multiballs are extremely unbalancing to this game. If you can play a few of each, a billion isn't out of the question. A trick to remember. The game can be tricked into awarding a left lane shot in multiball by shooting the Chef lane. Use this to your advantage.\r\n\r\nEntering the code LLRRLLRR in attract mode shows the design team credits.",
  "author_email": null,
  "release_date": "8.5.2016",
  "table_save_rev": "12",
  "table_version": null,
  "author_website": null,
  "table_save_date": "Wed Jul 26 00:19:45 2023",
  "table_description": "MOD by Bigus1",
  "properties": {},
  "properties_order": []
}